In [7]:
import numpy as np
import pandas as pd

In [18]:
data = {'Empresa':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB','GOOG'],
       'Nome':'Sam Charlie Amy Vanessa Carl Sarah Daniel'.split(),
       'Venda':[200, 120, 340, 124, 243, 350, 440]}

In [19]:
df = pd.DataFrame(data)

In [20]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350
6    GOOG   Daniel    440

In [21]:
group = df.groupby(by='Empresa') #retorna um objeto que ainda nao é um DataFrame de fato, apos realizar as operacoes nesse obj
                                 #ele retornará um dataframe

In [22]:
group.sum() #esse metodo realiza a soma de apenas colunas com numeros, tanto que ele ignorou a coluna nome

         Venda
Empresa
FB         593
GOOG       760
MSFT       464

In [23]:
group.describe() #retorna a descricao com alguns dados ja

        Venda
        count        mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.500000   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      3.0  253.333333  166.533280  120.0  160.00  200.0  320.00  440.0
MSFT      2.0  232.000000  152.735065  124.0  178.00  232.0  286.00  340.0

In [24]:
group.count() #conta o numero de ocorrencia em cada coluna

         Nome  Venda
Empresa
FB          2      2
GOOG        3      3
MSFT        2      2

In [25]:
group = df.groupby('Nome')

In [34]:
group.count().loc['Amy']

Empresa    1
Venda      1
Name: Amy, dtype: int64